export const projects = [
	{
	  name: 'CutPrice',
	  description: 'Это один из моих ключевых проектов, который я разработала с нуля до стадии MVP, а затем активно развивала. Это онлайн-платформа для компаний, позволяющая продвигать свой бизнес через рекламные баннеры и специальные предложения. Также платформа предназначена для пользователей, которые хотят оставаться в курсе лучших скидок и распродаж.Одним из самых сложных и одновременно увлекательных аспектов проекта было создание кода, который легко поддерживать и оптимизировать в будущем. Особое внимание уделялось тому, чтобы изменения в одном месте автоматически распространялись по всему проекту. Примером этого стало создание dataProvider для React Admin, что позволило избежать дублирования кода в различных компонентах и упростило внесение изменений.В проекте я использовала широкий спектр библиотек, включая react-admin, redux, i18n, axios, react-modal, formik, yup, react-hot-toast, svgr и framer motion. Я горжусь этим проектом, особенно тем, что принимала участие и в создании дизайна и реализовала локализацию на двух языках.',
	  link: 'https://cut-price.ge/'
	},
	{
		name: 'GlobalBank',
		description: 'Это современное банковское веб-приложение, созданное с использованием Vue, Pinia и Vite. Проект предоставляет удобный и интуитивно понятный интерфейс, позволяя пользователям ознакомиться с ключевой информацией о банке и его услугах на главной странице. В приложении также реализована форма для отправки запросов в банк, что обеспечивает быструю и удобную коммуникацию. Личный кабинет предоставляет пользователю доступ к персональной информации и имитацию подключения кредитной карты, создавая ощущение полного взаимодействия с банковской системой.',
		link: 'https://rina2316.github.io/GlobalBank/',
	 },
	{
		name: 'CryptoSite',
		description: 'Проект на Vue, созданный для погружения в криптомир. На главной странице собраны блоки информации о криптокошельках и биржах, график изменения цены в долларах, топ популярных вопросов и имитация подключения криптокошелька. Профиль пользователя включает данные о нём, график посещений и ссылки на соцсети.Используются демонстрационные данны для создания эффекта реального использования приложения.',
		link: 'https://rina2316.github.io/CryptoSite/',
	 },
	{
		name: 'TonKeeper',
		description: 'Это мой личный проект, криптокошелек, разработанный с использованием Next.js и Node.js, с подключением через ngrok. Приложение интегрируется с реальным кошельком, отображая адрес на первой странице и имитируя транзакции на второй. В шапке показывается актуальный баланс при подключении. Я использовал специфические библиотеки `@tonconnect/sdk` и `@tonconnect/ui-react`, что обеспечивает удобный интерфейс для работы с криптовалютой. Этот проект помог мне глубже понять блокчейн-технологии и Web3.',
		link: 'https://rina2316.github.io/TonKeeper/wallet',
	 },
	{
	  name: 'OnTop',
	  description: 'Проект посвящён рейтингам и обучающим курсам. В процессе работы одной из самых интересных и непростых задач стала реализация доступности. Это включало цветовую доступность (при помощи инструментов Chrome и Lighthouse), доступность через клавиатуру (работа с tabindex и событиями клавиатуры), а также поддержку работы со скринридерами.Ещё одним важным аспектом проекта стало интегрирование Яндекс.Метрики для отслеживания активности пользователей.Для разработки использовались библиотеки: axios, framer motion, react-hook-form, react-yandex-metrika, svgr и husky.',
	  link: 'https://rina2316.github.io/OnTop/',
	},
	{
		name: 'FormApp',
		description: 'Это приложение, созданное с использованием Next.js и TypeScript. В нем реализован интуитивно понятный интерфейс формы, который включает в себя  логику валидации и строгую проверку типов данных, обеспечивая надежность и точность ввода информации. Одной из особенностей приложения является динамическая пагинация. На первой странице она активируется только после успешного заполнения всех обязательных полей, что позволяет пользователю завершить форму поэтапно и без ошибок. На остальных страницах, представляющих собой заполнители, пагинация функционирует в стандартном режиме, обеспечивая плавный и удобный переход между шагами. Кроме того, в приложении предусмотрена адаптивная верстка, что гарантирует его корректное отображение и удобство использования на различных устройствах',
		link: 'https://rina2316.github.io/FORMA-app/',
	 },
	{
		name: 'Ambition',
		description: 'Этот проект посвящён аутсорсинговой маркетинговой компании. Он стал важным этапом моего развития, так как здесь я не только работала над техническими аспектами, но и наладила взаимодействие с клиентом: устанавливались чёткие сроки, понимались ожидания, проводились консультации.Я также принимала активное участие в разработке дизайна, полностью учитывая пожелания клиента. Проект был реализован на Angular с использованием таких библиотек, как rxjs и ngx-toastr.',
		link: 'https://rina2316.github.io/ambition-project/',
	 },
	{
	  name: 'FoodTruck',
	  description: 'Проект представляет собой сервис для доставки еды, созданный на чистом React с подключением React Router. Использованные библиотеки включают axios, redux, и react-router-dom. В этом проекте я акцентировала внимание на оптимизации взаимодействия с пользователем и простоте навигации.',
	  link: "https://rina2316.github.io/FoodTruck/",
	},
 ];