export const projects = [
	{
	  name: 'Ambition2',
	  description: 'Это один из моих ключевых проектов, который я разработала с нуля до стадии MVP, а затем активно развивала. Это онлайн-платформа для компаний, позволяющая продвигать свой бизнес через рекламные баннеры и специальные предложения. Также платформа предназначена для пользователей, которые хотят оставаться в курсе лучших скидок и распродаж.Одним из самых сложных и одновременно увлекательных аспектов проекта было создание кода, который легко поддерживать и оптимизировать в будущем. Особое внимание уделялось тому, чтобы изменения в одном месте автоматически распространялись по всему проекту. Примером этого стало создание dataProvider для React Admin, что позволило избежать дублирования кода в различных компонентах и упростило внесение изменений.В проекте я использовала широкий спектр библиотек, включая react-admin, redux, axios, react-modal, formik, yup, react-hot-toast, svgr и framer motion. Я горжусь этим проектом, особенно тем, что принимала участие и в создании дизайна.',
	  link: 'https://www.ambition.ge/',
	},
	{
		name: 'TonKeeper',
		description: '**Ton Keeper** — это мой личный проект, криптокошелек, разработанный с использованием Next.js и Node.js, с подключением через ngrok. Приложение интегрируется с реальным кошельком, отображая адрес на первой странице и имитируя транзакции на второй. В шапке показывается актуальный баланс при подключении. Я использовал специфические библиотеки `@tonconnect/sdk` и `@tonconnect/ui-react`, что обеспечивает удобный интерфейс для работы с криптовалютой. Этот проект помог мне глубже понять блокчейн-технологии и Web3.',
		link: 'https://rina2316.github.io/TonKeeper/wallet',
	 },
	{
	  name: 'OnTop',
	  description: 'Проект посвящён рейтингам и обучающим курсам. В процессе работы одной из самых интересных и непростых задач стала реализация доступности. Это включало цветовую доступность (при помощи инструментов Chrome и Lighthouse), доступность через клавиатуру (работа с tabindex и событиями клавиатуры), а также поддержку работы со скринридерами.Ещё одним важным аспектом проекта стало интегрирование Яндекс.Метрики для отслеживания активности пользователей.Для разработки использовались библиотеки: axios, framer motion, react-hook-form, react-yandex-metrika, svgr и husky.',
	  link: 'https://rina2316.github.io/OnTop/',
	},
	{
		name: 'Ambition',
		description: 'Этот проект посвящён аутсорсинговой маркетинговой компании. Он стал важным этапом моего развития, так как здесь я не только работала над техническими аспектами, но и наладила взаимодействие с клиентом: устанавливались чёткие сроки, понимались ожидания, проводились консультации.Я также принимала активное участие в разработке дизайна, полностью учитывая пожелания клиента. Проект был реализован на Angular с использованием таких библиотек, как rxjs и ngx-toastr.',
		link: 'https://rina2316.github.io/ambition-project/',
	 },
	{
	  name: 'FoodTruck',
	  description: 'Проект представляет собой сервис для доставки еды, созданный на чистом React с подключением React Router. Использованные библиотеки включают axios, redux, и react-router-dom. В этом проекте я акцентировала внимание на оптимизации взаимодействия с пользователем и простоте навигации.',
	  link: "https://rina2316.github.io/FoodTruck/",
	},
	{
	  name: 'MyDairy',
	  description: 'Это несложный проект для ведения личных записей, идей и впечатлений. Приложение было создано на чистом React, без использования дополнительного роутинга. Лёгкость и минимализм в подходе к разработке сделали этот проект отличным примером фокусировки на пользовательском опыте.',
	  link: "https://rina2316.github.io/journal-app/",
	},
 ];