{
	"welcome": "Привет! Добро пожаловать на страницу с моим портфолио. Меня зовут Жаркова Екатерина, и я Frontend-разработчик. Мой путь как веб-разработчика начался с сотрудничества с замечательной грузинской компанией Ambition, а также с интересных проектов на фрилансе. Здесь ты можешь узнать о технологиях, с которыми я работаю, посмотреть проекты, которые я реализовала, и познакомиться с моим опытом работы наглядно.",
	"aboutMeTag":"О себе",
	"aboutMe": "Я работаю с технологиями, которые помогают создавать современные, удобные и функциональные веб-приложения. Умею разрабатывать интерфейсы, которые сочетают эстетику и удобство, а также интегрировать их с backend-решениями. Постоянно учусь и стремлюсь совершенствовать свои навыки. В будущем планирую стать full-stack разработчиком, чтобы охватить полный цикл разработки.",
	"workExperienceTag":"Опыт работы",
	"workExperience":"Моё последнее место работы — компания Ambition. На этой позиции я взяла на себя множество обязанностей, начиная от верстки до разработки и интеграции сложных систем.",
	"responsibilitiesTag":"Обязаности",
	"responsibilitiesLi1":"Верстка адаптивных и кроссбраузерных интерфейсов",
	"responsibilitiesLi2":"Интеграция frontend с backend API",
	"responsibilitiesLi3":"Разработка админки с использованием React Admin",
	"achievementsTag":"Достижения",
	"achievementsLi1":"Разработка проекта с нуля до MVP",
	"achievementsLi2":"Создание современного дизайна, адаптированного под пользователей",
	"achievementsLi3":"Успешное развитие проекта и расширение его функционала",
	"projects":"Проекты",
	"projectsDescription":" Ниже представлены мои работы, с которыми вы можете ознакомится наглядно, нажав на иконку.",
	"technologies":"Технологии",
	"technologiesDescription":" Я работаю с такими технологиями, как React, Next.js, TypeScript, SCSS, а также использую инструменты для анимаций, такие как Framer Motion.",
	"formIntro":" Для вашего удобства вы можете оставить сообщение через форму ниже, и я свяжусь с вами в ближайшее время...",
	"header1":"Портфолио",
	"header2":"Жарковой Екатерины",
	"menu1":"Общая информация",
	"menu2":"Проекты",
   "menu3":"Технологии",
	"menu4":"Связь",
	"readMore":"Читать дальше",
	"readMore2":"Обратно",
	"allProjects": {
    "cutPrice": {
      "name": "Ambition2",
      "description": "Это один из моих ключевых проектов, который я разработала с нуля до стадии MVP, а затем активно развивала. Это онлайн-платформа для компаний, позволяющая продвигать свой бизнес через рекламные баннеры и специальные предложения. Также платформа предназначена для пользователей, которые хотят оставаться в курсе лучших скидок и распродаж. Одним из самых сложных и одновременно увлекательных аспектов проекта было создание кода, который легко поддерживать и оптимизировать в будущем. Особое внимание уделялось тому, чтобы изменения в одном месте автоматически распространялись по всему проекту. Примером этого стало создание dataProvider для React Admin, что позволило избежать дублирования кода в различных компонентах и упростило внесение изменений. В проекте я использовала широкий спектр библиотек, включая react-admin, redux, axios, react-modal, formik, yup, react-hot-toast, svgr и framer motion. Я горжусь этим проектом, особенно тем, что принимала участие и в создании дизайна.",
      "link": "https://www.ambition.ge/"
    },
    "onTop": {
      "name": "OnTop",
      "description": "Проект посвящён рейтингам и обучающим курсам. В процессе работы одной из самых интересных и непростых задач стала реализация доступности. Это включало цветовую доступность (при помощи инструментов Chrome и Lighthouse), доступность через клавиатуру (работа с tabindex и событиями клавиатуры), а также поддержку работы со скринридерами. Ещё одним важным аспектом проекта стало интегрирование Яндекс.Метрики для отслеживания активности пользователей. Для разработки использовались библиотеки: axios, framer motion, react-hook-form, react-yandex-metrika, svgr и husky.",
      "link": "https://rina2316.github.io/OnTop/"
    },
    "ambition": {
      "name": "Ambition",
      "description": "Этот проект посвящён аутсорсинговой - маркетинговой компании. Он стал важным этапом моего развития, так как здесь я не только работала над техническими аспектами, но и наладила взаимодействие с клиентом: устанавливались чёткие сроки, понимались ожидания, проводились консультации. Я также принимала активное участие в разработке дизайна, полностью учитывая пожелания клиента. Проект был реализован на Angular с использованием таких библиотек, как rxjs и ngx-toastr.",
      "link": "https://rina2316.github.io/ambition-project/"
    },
    "foodTruck": {
      "name": "FoodTruck",
      "description": "Проект представляет собой сервис для доставки еды, созданный на чистом React с подключением React Router. Использованные библиотеки включают axios, redux, и react-router-dom. В этом проекте я акцентировала внимание на оптимизации взаимодействия с пользователем и простоте навигации.",
      "link": "https://rina2316.github.io/FoodTruck/"
    },
    "myDairy": {
      "name": "MyDairy",
      "description": "Это несложный проект для ведения личных записей, идей и впечатлений. Приложение было создано на чистом React, без использования дополнительного роутинга. Лёгкость и минимализм в подходе к разработке сделали этот проект отличным примером фокусировки на пользовательском опыте.",
      "link": "https://rina2316.github.io/journal-app/"
    }
  },
  "form": {
    "name_label": "Как к вам обращаться?",
    "name_placeholder": "Введите имя или название компании",
    "email_label": "Ваш email",
    "email_placeholder": "Введите вашу почту",
    "phone_label": "Ваш номер телефона",
    "phone_placeholder": "Введите ваш номер телефона",
    "message_label": "Ваше сообщение",
    "message_placeholder": "Введите ваше сообщение",
    "submit_button": "Отправить сообщение",
    "name_required": "Имя или название компании обязательно",
    "email_invalid": "Неверный формат email",
    "email_required": "Обязательное поле",
    "phone_invalid": "Неверный формат номера телефона",
    "phone_required": "Номер телефона обязателен"
  },
  "downloadButton":"Скачать рекомендательное письмо"
}
