{
	
	"welcome": "Hello! Welcome to my portfolio page. My name is Ekaterina Zharkova, and I am a Frontend Developer. My journey as a web developer began with a collaboration with the wonderful Georgian company Ambition, along with exciting freelance projects. Here, you can explore the technologies I work with, review the projects I've completed, and get a visual insight into my professional experience.",
	"aboutMeTag":"About Me",
	"aboutMe": "I work with technologies that help create modern, user-friendly, and functional web applications. I specialize in developing interfaces that blend aesthetics with usability and seamlessly integrate them with backend solutions. I'm constantly learning and striving to improve my skills. In the future, I aim to become a full-stack developer to cover the entire development cycle.",
	"workExperienceTag":"Work Experience",
	"workExperience":"My latest role was at Ambition, where I undertook a wide range of responsibilities, from front-end development to the design and integration of complex systems.",
	"responsibilitiesTag":"Responsibilities",
	"responsibilitiesLi1":"Layout of adaptive and cross-browser interfaces",
	"responsibilitiesLi2":"Integration of frontend with backend API",
	"responsibilitiesLi3":"Development of the admin panel using React Admin",
	"achievementsTag":"Achievements",
	"achievementsLi1":"Project development from scratch to MVP",
	"achievementsLi2":"Creating a modern design adapted to users",
	"achievementsLi3":"Successful development of the project and expansion of its functionality",
	"projects":"Projects",
	"projectsDescription":" Below are my works, which you can view visually by clicking on the icon.",
	"technologies":"Technologies",
	"technologiesDescription":"I work with technologies such as React, Next.js, TypeScript, SCSS, and also with animation tools such as Framer Motion.",
	"formIntro":"For your convenience, you can leave a message using the form below, and I will contact you as soon as possible...",
	"header1":"Portfolio of",
	"header2":"Zharkova Ekaterina",
	"menu1":"General information",
   "menu2": "Projects",
   "menu3": "Technologies",
   "menu4":"Communication",
	"readMore":"Read more",
	"readMore2":"Back",
	"allProjects": {
    "cutPrice": {
      "name": "Ambition2",
      "description": "This is one of my key projects that I developed from scratch to the MVP stage and then actively expanded. It is an online platform for companies to promote their business through advertising banners and special offers. The platform is also intended for users who want to stay informed about the best discounts and sales. One of the most challenging yet exciting aspects of the project was creating code that is easy to maintain and optimize in the future. Special attention was paid to ensuring that changes in one place automatically propagate throughout the project. An example of this was creating a dataProvider for React Admin, which helped avoid code duplication in various components and simplified making changes. In this project, I used a wide range of libraries, including react-admin, redux, axios, react-modal, formik, yup, react-hot-toast, svgr, and framer motion. I am proud of this project, especially for my involvement in creating the design.",
      "link": "https://www.ambition.ge/"
    },
    "onTop": {
      "name": "OnTop",
      "description": "This project is dedicated to rankings and educational courses. One of the most interesting and challenging tasks during the work process was implementing accessibility. This included color accessibility (using Chrome and Lighthouse tools), keyboard accessibility (working with tabindex and keyboard events), as well as supporting screen readers. Another important aspect of the project was integrating Yandex.Metrica for tracking user activity. The libraries used for development included axios, framer motion, react-hook-form, react-yandex-metrika, svgr, and husky.",
      "link": "https://ontop.example.com"
    },
    "ambition": {
      "name": "Ambition",
      "description": "This project is dedicated to an outsourcing marketing company. It was an important milestone in my development, as here I not only worked on the technical aspects but also established interaction with the client: clear deadlines were set, expectations were understood, and consultations were held. I also actively participated in the design development, fully considering the client's wishes. The project was implemented on Angular using libraries such as rxjs and ngx-toastr.",
      "link": "https://rina2316.github.io/ambition-project/"
    },
    "foodTruck": {
      "name": "FoodTruck",
      "description": "This project is a food delivery service created with pure React using React Router. The libraries used include axios, redux, and react-router-dom. In this project, I focused on optimizing user interaction and simplicity of navigation.",
      "link": "https://foodtruck.example.com"
    },
    "myDairy": {
      "name": "MyDairy",
      "description": "This is a simple project for keeping personal notes, ideas, and impressions. The application was created with pure React, without additional routing. The simplicity and minimalism in the approach to development made this project an excellent example of focusing on user experience.",
      "link": "https://rina2316.github.io/journal-app/"
    }
  },
  "form": {
"name_label": "How should I contact you?",
"name_placeholder": "Enter your name or company name",
"email_label": "Your email",
"email_placeholder": "Enter your email",
"phone_label": "Your phone number",
"phone_placeholder": "Enter your phone number",
"message_label": "Your message",
"message_placeholder": "Enter your message",
"submit_button": "Send a message",
"name_required": "Name or company name required",
"email_invalid": "Invalid email format",
"email_required": "Required field",
"phone_invalid": "Invalid phone number format",
"phone_required": "Phone number required"
},
  "downloadButton":"Download recommendation letter"
}
